Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.0.23/samha0rb/edc/ATSAMHA0G14RB.PIC
      <edc:SFRDef edc:_addr="0x4200282C" edc:access="------------nnnnnnnnn-------nnnn" edc:cname="INTFLAG" edc:impl="0xFF80F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:desc="Retrigger" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Counter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Error" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="Match or Capture 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="Match or Capture 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:desc="Match or Capture 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:desc="Match or Capture 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002830" edc:access="----nnnn----nnnnnnnnnnnnnnnnn-nn" edc:cname="STATUS" edc:impl="0xF0FFFFB" edc:mclr="00000000000000000000000000000001" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="STOP" edc:desc="Stop" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDX" edc:desc="Ramp" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLAVE" edc:desc="Slave" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PATTBV" edc:desc="Pattern Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAVEBV" edc:desc="Wave Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERBV" edc:desc="Period Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTAIN" edc:desc="Recoverable Fault A Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTBIN" edc:desc="Recoverable Fault B Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0IN" edc:desc="Non-Recoverable Fault0 Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1IN" edc:desc="Non-Recoverable Fault1 Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0 State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1 State" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV0" edc:desc="Compare Channel 0 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV1" edc:desc="Compare Channel 1 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV2" edc:desc="Compare Channel 2 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBV3" edc:desc="Compare Channel 3 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare Channel 0 Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare Channel 1 Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:desc="Compare Channel 2 Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP3" edc:desc="Compare Channel 3 Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002834" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="COUNT" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002838" edc:access="nnnnnnnnnnnnnnnn" edc:cname="PATT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="PGE0" edc:desc="Pattern Generator 0 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE1" edc:desc="Pattern Generator 1 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE2" edc:desc="Pattern Generator 2 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE3" edc:desc="Pattern Generator 3 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE4" edc:desc="Pattern Generator 4 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE5" edc:desc="Pattern Generator 5 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE6" edc:desc="Pattern Generator 6 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGE7" edc:desc="Pattern Generator 7 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV0" edc:desc="Pattern Generator 0 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV1" edc:desc="Pattern Generator 1 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV2" edc:desc="Pattern Generator 2 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV3" edc:desc="Pattern Generator 3 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV4" edc:desc="Pattern Generator 4 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV5" edc:desc="Pattern Generator 5 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV6" edc:desc="Pattern Generator 6 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGV7" edc:desc="Pattern Generator 7 Output Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
